{
  "main": {
    "name":"Toni Sánchez",
    "welcomeTitle": "`welcome ${you}`",
    "description":"I am Toni, a Developer in ❤️ with JS and my 🐶 Lennon.",
    "image":"profilepic.jpg",
    "bioWhat":"I develop engaging, modern and extremely automated digital products, such as mobile, web and desktop applications as well as GraphQL API and REST API, my mantra: \"Scalable, Reusable, Maintainable\". I achieve scalability and reusability by separating the \"UI\" from the \"data\" as far as possible and beyond. I succeed on making it maintainable by always working with TDD approach, trying to become better at testing that I am at coding. Full Stack skills, from designing a fresh prototype with Sketch to develop with React, querying mongodb, creating back end API with Node to programming a server with Express. I still don't have a favorite field yet, as long as I can use React on a daily basis.",
    "bioHow": "Passionate about functional programming. I am not scared of using mathematical thinking. My mind thinks in JavaScript, my stack is MERN, but I choose to live the JS fatigue, always ready for next framework. Android/iOS apps with React Native, desktop apps with Electron JS or Java. I can work with jQuery instead of React or complementing it, PHP instead of Node, Python instead of Java and SQL instead of Mongo, although I would not choose that stack and therefore I am not that creative with it as with MERN.",
    "bioWhen": "All applications listed on this site (included this site, ha) are developed with React. Despite earlier versions of a+Eco REST API that where querying SQL with PHP in the back, earlier versions and the rest of the applications are querying mongoDB using Node. There is no scalability without Redux, I implement it 99% of the cases, even when the project looks apparently small. Last, and less important, I also tend to work with SASS or other pre-processors when project gets too big.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "tonisanchez.dev@gmail.com",
    "phone": "555-555-5555",
    "telegram": "@T4733",
    "telegramLink": "https://t.me/T4733",
    "github":"https://github.com/TonySapa",
    "project":"https://",
    "address":{
      "street":"(Your Street)",
      "city":"Barcelona",
      "state":"Spain",
      "zip": "(Your Zip/Postal Code)"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"http://timbakerdev.com",
    "social":[
      {
        "name":"github",
        "url":"https://github.com/TonySapa",
        "className":"fa fa-github"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/toni-s-b66ba0191/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"twitter",
        "url":"http://twitter.com/tonisanchezdev",
        "className":"fa fa-twitter"
      },
      {
        "name":"telegram",
        "url":"https://t.me/T4733",
        "className":"fa fa-phone"
      }
    ]
  },
  "resume":{
    "skillmessage":"This list was intentionally left incomplete, showing the most relevant skills.",
    "education":[
      {
        "school":"University of Helsinki",
        "degree":"BSc in Computer Science",
        "graduated":"Coursing part-time",
        "description":"Completed courses: Full Stack Open. MongoDB, Express, React, Node. (9 ECTS), Full Stack Open Project (10 ECTS), Introduction to Programming. Java I. (5 ECTS), Advanced Programming. Java II. (5 ECTS), DevOps with Docker (3 ECTS), Elements of AI (2 ECTS)"
      },
      {
        "school":"Universitat Pompeu Fabra",
        "degree":"BSc in International Business Economics",
        "graduated":"2015 - 2016 (1st year only)",
        "description":"Completed courses: Accounting I, Mathematics I, Microeconomics I, Macroeconomics I, Business Economics, Statistics & Data Analysis I, International Law I."
      }
    ],
    "certifications":[
      {
        "name": "C100DEV: Certified Developer",
        "issuing": "MongoDB Official Certification",
        "description": "C100DEV Exam + M001, M103, M121, M220, M201 and M320 courses. Philosophy & Features: performance, JSON, BSON, fault tolerance, disaster recovery, horizontal scaling, and the Mongo shell CRUD: Create, Read, Update, and Delete operations Data Modeling: embedding, references, document growth, modeling one-to-one and one-to-many relationships, modeling for atomic operations, modeling tree structures Indexing and Performance: single key, compound, multi-key, mechanics, storage engines, and performance Aggregation: pipeline, operators, memory usage, sort, skip, and limit Replication: configuration, oplog concepts, write concern, elections, failover, and deployment to multiple data centers Sharding: components, when to shard, balancing, shard keys, and hashed shard keys.",
        "badge": "c100dev_mongodb.png"
      },
      {
        "name": "Professional Collaboration Engineer",
        "issuing": "Google Official Certification",
        "description": "A Professional Collaboration Engineer transforms business objectives into tangible configurations, policies, and security practices as they relate to users, content, and integrations. Collaboration Engineers leverage their understanding of their organization’s mail routing and identity management infrastructure to enable efficient and secure communication and data access. Operating with an engineering and solutions mindset, they use tools, programming languages, and APIs to automate workflows. They look for opportunities to educate end users and increase operational efficiency while advocating for G Suite and the Google toolset.",
        "badge": "collaborationEngineer.png"
      },
      {
        "name": "AWS Certified Cloud Practitioner",
        "issuing": "AWS Official Certification",
        "description": "The AWS Certified Cloud Practitioner examination is intended for individuals who have the knowledge and skills necessary to effectively demonstrate an overall understanding of the AWS Cloud, independent of specific technical roles addressed by other AWS Certifications.",
        "badge": "AWS-CloudPractitioner.png"
      },
      {
        "name": "98-383: HTML & CSS",
        "issuing": "Microsoft Official Certification",
        "description": "Exam venue: PUE, Barcelona on August 23, 2019 at 11:00am, language: English. Microsoft Technology Associate in Programming with HTML & CSS.",
        "badge": "mta98383.png",
        "badge_link": "https://www.youracclaim.com/badges/a6c15b29-adf8-4b97-b39b-a4ade382f60c/public_url"
      },
      {
        "name": "MOS Excel 2016 Expert",
        "issuing": "Microsoft Official Certification",
        "description": "Exam venue: PUE, Barcelona on September 13th, 2019 at 11:00am, language: English. Microsoft Excel 2016 Expert Certification exam earners have an advanced understanding of Excel 2016, and create, manage, and distribute professional spreadsheets for a variety of specialized purposes. They customize their Excel environments and enhance productivity in custom business templates, multiple-axis financial charts, amortization tables, and inventory schedules. Excel earners include accountants, financial analysts, data analysts, and commercial bankers.",
        "badge": "mos2016expert.png",
        "badge_link": "https://www.youracclaim.com/badges/806e99b9-37f1-4d8b-955f-bfeed94b6486"
      },
      {
        "name": "MOS Excel 2016",
        "issuing": "Microsoft Official Certification",
        "description": "Exam venue: PUE, Barcelona on August 2, 2019 at 11:00am, language: English. Microsoft Excel 2016 Certification exam earners have a fundamental understanding of Excel 2016 and the ability to complete tasks independently. Earners have proven they can create and edit a workbook with multiple sheets, and use graphic elements to represent data visually including professional-looking budgets, financial statements, performance charts, and data-entry logs. Excel earners include students, business professionals, clerical workers, bookkeepers, educators, and others.",
        "badge": "mos2016.png",
        "badge_link": "https://www.youracclaim.com/badges/a6c15b29-adf8-4b97-b39b-a4ade382f60c/public_url"
      }
    ],
    "work":[
      {
        "company":"Freelance",
        "title":"Full Stack Developer",
        "years":"2017 - current",
        "description":"Coding for different free open source applications, UI/UX kits, React templates, modern websites and web browser extensions."
      },
      {
        "company":"ticktax.io",
        "title":"Full Stack Developer",
        "years":"2020 - current",
        "description":"Releasing full version in 2021. Web/Mobile/Desktop app. Fully automated accounting/taxation suite for freelancers and small companies. OCR (optical character recognition) to detect and automate accounting and tax processes, chatbot for elemental tax/legal advice, and many other tools. Integration with Sage®, A3eco®, Quickbooks® and many others. And other more interesting secret features. Server programmed in Node using Express. All CRUD operations querying MongoDB. Scalable and reusable front end built with React and tested with Jest. E2E testing with Cypress."
      },
      {
        "company":"Ilia Consulting | ETL Global",
        "title":"Full Stack Developer",
        "years":"2019 - 2020",
        "description":"Automation of accounting processes with Scripts. Developed internal tools in React, PHP and SQL. Other IT and Accounting support tasks."
      },
      {
        "company":"De Rosa i Associats",
        "title":"Jr. Accountant",
        "years":"2018",
        "description":"Accounting and bookkeeping in a modern online accounting firm specialised in automated accounting and taxation.",
        "achievements": [
          "Automated duplicated invoices alert with automatic outlook e-mail sent to the customer, using PowerQuery and SQL.",
          "Automated something."
        ]
      }
    ],
    "skills":[
      {
        "name":"HTML5 & CSS3",
        "level":"98%"
      },
      {
        "name":"ES6 JavaScript",
        "level":"75%"
      },
      {
        "name":"Java",
        "level":"73%"
      },
      {
        "name":"React",
        "level":"72%"
      },
      {
        "name":"MongoDB",
        "level":"70%"
      },
      {
        "name":"Node",
        "level":"60%"
      },
      {
        "name":"PHP",
        "level":"50%"
      },
      {
        "name":"AWS",
        "level":"50%"
      },
      {
        "name":"Azure",
        "level":"50%"
      },
      {
        "name":"Google Cloud",
        "level":"50%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"ticktax.io",
        "category":"Accounting suite for tax automation. API Integration with SAGE®, a3Eco®, Quickbooks® and more.",
        "image":"ticktax.io-landing-page.png",
        "url":"https://www.ticktax.io"
      },
      {
        "title":"***",
        "category":"Desktop/Android/iOS/Web application for HR process automation, project management and payslip management.",
        "image":"github-hrapp.png",
        "url":"https://github.com/TonySapa/hr-back"
      },
      {
        "title":"a+Eco",
        "category":"REST API tool to encode and decode a3ECO files, the only free alternative to the official tool.",
        "image":"github-a3eco.png",
        "url":"https://github.com/TonySapa/aplus-eco"
      },
      {
        "title":"reactSavvy",
        "category":"Blog about React best practices and modern React development guides",
        "image":"reactSavvy-blog.png"
      }
    ]
  }
}
